[
  {
    "title": "IOS Test-Driven Development by Tutorials (First Edition): Learn Real-World Test-Driven Development",
    "authors": [
      "Joshua Greene",
      "Michael Katz",
      "Raywenderlich Tutorial Team"
    ],
    "publishedDate": "2019-12-02",
    "description": "Learn how to test iOS Applications! iOS Test-Driven Development introduces you to a broad range of concepts with regard to not only writing an application from scratch with testing in mind, but also applying these concepts to already written applications which have little or no tests written for their functionality. Who This Book Is For This book is for intermediate iOS developers who already know the basics of iOS and Swift development but want to learn how to write code which is both testable and maintainable. Topics Covered in iOS Test-Driven Development The TDD Cycle: Learn the concepts of Test-Driven Development and how to implement these concepts within an iOS application. Test Expressions and Expectations: Learn how to test both synchronous code using expressions and asynchronous code using expectations. Test RESTful Networking: Write tests to verify networking endpoints and the ability to mock the returned results. Test Authentication: Write tests which run against authenticated endpoints. Legacy Problems: Explore the problems legacy applications written without any unit tests or without thought of testing the code. Breaking Dependencies into Modules: Learn how to take dependencies within your code and compartmentalize these into their own modules with their own tests. Refactoring Large Classes: Learn how to refactor large unweilding classes into smaller more manageable and testable classes / objects. One thing you can count on: after reading this book, you'll be prepared to write testable applications which you can have confidence in making changes too with the knowledge your tests will catch breaking changes.",
    "image": "http://books.google.com/books/content?id=bwSxzAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 328,
    "isbn10": "194287880X",
    "isbn13": "9781942878803",
    "googleBooks": {
      "id": "bwSxzAEACAAJ",
      "preview": "http://books.google.com/books?id=bwSxzAEACAAJ&dq=intitle:IOS+Test-Driven+Development+by+Tutorials+(First+Edition):+Learn+Real-World+Test-Driven+Development+by+Joshua+Greene,+Michael+Katz&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=bwSxzAEACAAJ&dq=intitle:IOS+Test-Driven+Development+by+Tutorials+(First+Edition):+Learn+Real-World+Test-Driven+Development+by+Joshua+Greene,+Michael+Katz&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/IOS_Test_Driven_Development_by_Tutorials.html?hl=&id=bwSxzAEACAAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-07-21T07:15:00.000Z"
  },
  {
    "title": "RxSwift (Fourth Edition)",
    "authors": [
      "raywenderlich Tutorial Team",
      "Junior Bontognali",
      "Scott Gardner",
      "Florent Pillet",
      "Shai Mishali",
      "Marin Todorov"
    ],
    "publishedDate": "2020-08-11",
    "description": "Learn Reactive Programming in Swift with RxSwift!The popularity of reactive programming continues to grow on an every-increasing number of platforms and languages. Rx lets developers easily and quickly build apps with code that can be understood by other Rx developers - even over different platforms.Not only will you learn how to use the RxSwift port to create complex reactive applications on iOS, you'll also see how to easily solve common application design issues by using RxSwift. Finally you'll discover how to exercise full control over the library and leverage the full power of reactive programming in your apps.This books is for iOS developers who already feel comfortable with iOS and Swift, and want to dive deep into development with RxSwift.Topics Covered in RxSwift:- Getting Started: Get an introduction to the reactive programming paradigm, learn the terminology involved and see how to begin using RxSwift in your projects.- Event Management: Learn how to handle asynchronous event sequences via two key concepts in Rx - Observables and Observers.- Being Selective: See how to work with various events using concepts such as filtering, transforming, combining, and time operators.- UI Development: RxSwift makes it easy to work with UI of your apps using RXCocoa, which provides integration of both UIKit and Cocoa.- Intermediate Topics: Level up your RxSwift knowledge with chapters on reactive networking, multi-threading, and error handling.And much, much more!By the end of this book, you'll have hands-on experience solving common issues in a reactive paradigm - and you'l be well on your way to coming up with your own Rx patterns and solutions!",
    "image": "http://books.google.com/books/content?id=UhmBzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "isbn10": "1950325245",
    "isbn13": "9781950325245",
    "googleBooks": {
      "id": "UhmBzgEACAAJ",
      "preview": "http://books.google.com/books?id=UhmBzgEACAAJ&dq=intitle:RxSwift+(Fourth+Edition):+Reactive+Programming+with+Swift++by+Junior+Bontognali,+Scott+Gardner,+Florent+Pillet,+Shai+Mishali,+Marin+Todorov&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=UhmBzgEACAAJ&dq=intitle:RxSwift+(Fourth+Edition):+Reactive+Programming+with+Swift++by+Junior+Bontognali,+Scott+Gardner,+Florent+Pillet,+Shai+Mishali,+Marin+Todorov&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/RxSwift_Fourth_Edition.html?hl=&id=UhmBzgEACAAJ"
    },
    "issueNumber": 3,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-07-21T07:12:13.000Z"
  },
  {
    "title": "Advanced Git (Second Edition)",
    "authors": [
      "Jawwad Ahmad",
      "Raywenderlich Tutorial Team",
      "Chris Belanger"
    ],
    "publisher": "Razeware LLC",
    "publishedDate": "2021-10-12",
    "description": "Get Advanced With Git! If you're involved with software development, chances are you've heard of and used Git at some point. Version control systems are critical for any successful collaborative software project. Git is simple to start using, while accommodating the most complex tasks with version control. However, even seasoned Git users hit roadblocks on how to handle everyday situations. Advanced Git is here to help! This book begins where the other Git book in our catalog, \"Git Apprentice\", ends. Who This Book Is For This book is for anyone who wants to leverage version control's power with Git in their software development process. It starts with a look under Git's hood, then moves on to more complicated scenarios including merge conflicts, rebasing and more. Finally, you'll learn common workflows using Git. Topics Covered in Advanced Git How Git actually works: After using Git for a while, it's good to discover the whys behind all the things. Rebasing: A more advanced way of merging code and collaborating. Merge Conflicts & Undo: You'll eventually run into problems while using Git. Find out how to handle them with ease. Workflows in Git: Working with Git requires some rules to ensure things go smoothly across development teams. Learn the most common workflows and how to decide which to use for your project. One thing you can count on: After reading this book, you'll be well-prepared to use Git in your software development workflow!",
    "image": "http://books.google.com/books/content?id=sDSvzgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 238,
    "isbn10": "1950325504",
    "isbn13": "9781950325504",
    "googleBooks": {
      "id": "sDSvzgEACAAJ",
      "preview": "http://books.google.com/books?id=sDSvzgEACAAJ&dq=intitle:Advanced+Git+(Second+Edition):+Understanding+Git+Collaboration+%26+Workflows+by+Chris+Belanger+and+Jawwad+Ahmad&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=sDSvzgEACAAJ&dq=intitle:Advanced+Git+(Second+Edition):+Understanding+Git+Collaboration+%26+Workflows+by+Chris+Belanger+and+Jawwad+Ahmad&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Advanced_Git_Second_Edition.html?hl=&id=sDSvzgEACAAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-07-21T07:08:47.000Z"
  },
  {
    "title": "iOS 15 Programming for Beginners",
    "authors": [
      "Ahmad Sahar",
      "Craig Clayton"
    ],
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2021-12-24",
    "description": "iOS 15 Programming for Beginners is an introductory guide to learning the essentials of Swift programming and iOS development for building your first iOS app and publishing it on the App Store. Fully updated to cover the latest features in iOS 15, this practical guide will help you get up to speed with writing iOS apps from scratch.",
    "image": "http://books.google.com/books/content?id=-J1WEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 784,
    "isbn10": "1801812136",
    "isbn13": "9781801812139",
    "googleBooks": {
      "id": "-J1WEAAAQBAJ",
      "preview": "http://books.google.com/books?id=-J1WEAAAQBAJ&printsec=frontcover&dq=intitle:IOS+15+Programming+for+Beginners:+Kickstart+Your+Mobile+App+Development+Journey+by+Building+IOS+Apps+with+Swift+5.5+and+Xcode+13,+6th+Edition+by+Ahmad+Sahar+and+Craig+Clayton&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=-J1WEAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=-J1WEAAAQBAJ"
    },
    "issueNumber": 1,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2022-07-21T07:04:47.000Z"
  }
]
